import random
import sys
import pyperclip

# 获取有效的常用汉字列表
# LOG = []
# with open('常用汉字.txt', 'r', encoding='utf-8') as f:
#     lines = f.readlines()
#     for line in lines:
#         line = line.strip()
#         LOG.append(line)
# print(LOG)

# 获取英文大小写字母
# LOG = []
# with open('英文字母.txt', 'r', encoding='utf-8') as f:
#     lines = f.readlines()
#     for line in lines:
#         line = line.strip()
#         LOG.append(line)
# print(LOG)

# 获取标点符号
# LOG = []
# with open('标点符号.txt', 'r', encoding='utf-8') as f:
#     lines = f.readlines()
#     for line in lines:
#         line = line.strip()
#         LOG.append(line)
# print(LOG)

# 获取英文标点
# LOG = []
# with open('英文标点.txt', 'r', encoding='utf-8') as f:
#     lines = f.readlines()
#     for line in lines:
#         line = line.strip()
#         LOG.append(line)
# print(LOG)

list_chinese = ['的', '一', '是', '在', '不', '了', '有', '和', '人', '这', '中', '大', '为', '上', '个', '国', '我',
                '以', '要', '他', '时', '来', '用', '们', '生', '到', '作', '地', '于', '出', '就', '分', '对', '成',
                '会', '可', '主', '发', '年', '动', '同', '工', '也', '能', '下', '过', '子', '说', '产', '种', '面',
                '而', '方', '后', '多', '定', '行', '学', '法', '所', '民', '得', '经', '十', '三', '之', '进', '着',
                '等', '部', '度', '家', '电', '力', '里', '如', '水', '化', '高', '自', '二', '理', '起', '小', '物',
                '现', '实', '加', '量', '都', '两', '体', '制', '机', '当', '使', '点', '从', '业', '本', '去', '把',
                '性', '好', '应', '开', '它', '合', '还', '因', '由', '其', '些', '然', '前', '外', '天', '政', '四',
                '日', '那', '社', '义', '事', '平', '形', '相', '全', '表', '间', '样', '与', '关', '各', '重', '新',
                '线', '内', '数', '正', '心', '反', '你', '明', '看', '原', '又', '么', '利', '比', '或', '但', '质',
                '气', '第', '向', '道', '命', '此', '变', '条', '只', '没', '结', '解', '问', '意', '建', '月', '公',
                '无', '系', '军', '很', '情', '者', '最', '立', '代', '想', '已', '通', '并', '提', '直', '题', '党',
                '程', '展', '五', '果', '料', '象', '员', '革', '位', '入', '常', '文', '总', '次', '品', '式', '活',
                '设', '及', '管', '特', '件', '长', '求', '老', '头', '基', '资', '边', '流', '路', '级', '少', '图',
                '山', '统', '接', '知', '较', '将', '组', '见', '计', '别', '她', '手', '角', '期', '根', '论', '运',
                '农', '指', '几', '九', '区', '强', '放', '决', '西', '被', '干', '做', '必', '战', '先', '回', '则',
                '任', '取', '据', '处', '队', '南', '给', '色', '光', '门', '即', '保', '治', '北', '造', '百', '规',
                '热', '领', '七', '海', '口', '东', '导', '器', '压', '志', '世', '金', '增', '争', '济', '阶', '油',
                '思', '术', '极', '交', '受', '联', '什', '认', '六', '共', '权', '收', '证', '改', '清', '己', '美',
                '再', '采', '转', '更', '单', '风', '切', '打', '白', '教', '速', '花', '带', '安', '场', '身', '车',
                '例', '真', '务', '具', '万', '每', '目', '至', '达', '走', '积', '示', '议', '声', '报', '斗', '完',
                '类', '八', '离', '华', '名', '确', '才', '科', '张', '信', '马', '节', '话', '米', '整', '空', '元',
                '况', '今', '集', '温', '传', '土', '许', '步', '群', '广', '石', '记', '需', '段', '研', '界', '拉',
                '林', '律', '叫', '且', '究', '观', '越', '织', '装', '影', '算', '低', '持', '音', '众', '书', '布',
                '复', '容', '儿', '须', '际', '商', '非', '验', '连', '断', '深', '难', '近', '矿', '千', '周', '委',
                '素', '技', '备', '半', '办', '青', '省', '列', '习', '响', '约', '支', '般', '史', '感', '劳', '便',
                '团', '往', '酸', '历', '市', '克', '何', '除', '消', '构', '府', '称', '太', '准', '精', '值', '号',
                '率', '族', '维', '划', '选', '标', '写', '存', '候', '毛', '亲', '快', '效', '斯', '院', '查', '江',
                '型', '眼', '王', '按', '格', '养', '易', '置', '派', '层', '片', '始', '却', '专', '状', '育', '厂',
                '京', '识', '适', '属', '圆', '包', '火', '住', '调', '满', '县', '局', '照', '参', '红', '细', '引',
                '听', '该', '冯', '价', '严', '龙', '飞']
list_english = ['A', 'a', 'B', 'b', 'C', 'c', 'D', 'd', 'E', 'e', 'F', 'f', 'G', 'g', 'H', 'h', 'I', 'i', 'J', 'j', 'K',
                'k', 'L', 'l', 'M', 'm', 'N', 'n', 'O', 'o', 'P', 'p', 'Q', 'q', 'R', 'r', 'S', 's', 'T', 't', 'U', 'u',
                'V', 'v', 'W', 'w', 'X', 'x', 'Y', 'y', 'Z', 'z']
list_pmark = ['。', '？', '！', '，', '、', '；', '：', '“', '”', '‘', '’', '「', '」', '『', '』', '（', '）', '[', ']', '〔', '〕',
              '【', '】', '—', '…', '·', '-', '～', '·', '《', '》', '〈', '〉', '_', '/']
list_emark = ['.', '?', '!', ',', ':', '...', ';', '-', '–', '—', '(', ')', '[', ']', '{', '}', '"', "'", '’']
list_special = [' ', '@', '%', '#', '~', '$', '^', '&', '*', '+', '/', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
list_all = list_chinese + list_english + list_pmark + list_emark + list_special

print('\033[31mThe Version Of This Software is V0.7.1\033[0m')


def data_get():
    print('\033[31m输入e或者exit退出系统!!!\033[0m')
    n = input("请输入所需字符数目：")
    if n == 'e' or n == 'exit':
        sys.exit()
    else:
        n = int(n)
    list_get = []
    count_ch = 0
    count_en = 0
    count_pm = 0
    count_em = 0
    count_sp = 0
    i = 1
    random.shuffle(list_all)
    while i <= n:
        tmp = random.choice(list_all)
        if tmp in list_chinese:
            count_ch += 1
        elif tmp in list_english:
            count_en += 1
        elif tmp in list_pmark:
            count_pm += 1
        elif tmp in list_emark:
            count_em += 1
        elif tmp in list_special:
            count_sp += 1
        list_get.append(tmp)
        i += 1
    mark = ''
    tag = mark.join(list_get)
    print(tag)
    pyperclip.copy(tag)
    print('当前文本存在常用汉字：' + str(count_ch) + '个')
    print('当前文本存在英文字母：' + str(count_en) + '个')
    print('当前文本存在中文标点：' + str(count_pm) + '个')
    print('当前文本存在英文标点：' + str(count_em) + '个')
    print('当前文本存在特殊符号：' + str(count_sp) + '个')
    data_get()


if __name__ == '__main__':
    data_get()
